<template>
    <h1>账号关联</h1>
    账号关联用于把你在不同平台的身份关联到本站账号，你可以借助这个功能在不同平台上认识更多朋友。账号关联功能在个人主页的《账号关联》选项卡中。
    <span v-if="store.login_status === LoginStatus.IsLogin">
        你可以<a :href="`player/${store.user.id}/accountlink`">点击这里</a>直接进入该界面。
    </span>
    <span v-else>
        你需要先登录才能操作自己的账号关联。
    </span>

    <h2>账号关联的流程</h2>
    <ol>在账号关联的界面中，如果你未关联所有我们支持的平台，你可以看到一个加号按钮，点击该按钮会显示一个弹窗引导你进行账号关联。</ol>
    <ol>输入平台和id后，为了防止冒领他人账号，你需要取得管理员的信任，让管理员认证该账号。</ol>

    <h3>关于id的注意事项</h3>
    “id”这个词存在一定歧义，在部分网站有可能理解为用户名或昵称。对于我们目前支持的所有平台，id应当是一串数字。你选择账号所在的平台后，下方应当会加载出寻找对应平台的id的方法。

    一旦确认关联，操作不可撤销（请参与代码贡献，帮我们解决这个问题），因此请谨慎填写id。如果确实填错了id，请联系管理员处理。

    <h3>如何取得管理员信任</h3>
    扫雷网、Minesweeper.Online、哔哩哔哩、腾讯QQ都支持私信，直接在这些平台私信管理员账号，告诉管理员你的开源扫雷网id，只要信息一致，管理员应当认证该账号。国际网支持你关联扫雷网和Minesweeper.Online账号，如果这些账号和你在开源扫雷网上关联的一致，管理员应当认证你的国际网账号。

    <h2>隐私相关问题</h2>
    开源扫雷网是实名制的，所以一旦关联了其他平台的账号，意味着该平台上其他用户可以知晓你的实名。有的平台账号关联仅用于客服支持，那么该账号是私密的，只对于管理员可见。目前腾讯QQ是私密平台。

    <h3>为什么自媒体平台不是私密平台？</h3>
    我们即将开发创作推广功能，这个功能允许你在开源扫雷网推广你在自媒体平台上的扫雷作品。从你推广你的作品开始，你在该自媒体平台上的账号已经暴露了。如果你不需要推广你的作品，就没有必要，而且我们也不建议关联自媒体账号。
</template>

<script setup lang="ts">
import { store } from '@/store';
import '@/styles/text.css';
import { LoginStatus } from '@/utils/common/structInterface';
</script>
